In [2]:
import pandas as pd
df=pd.read_csv("eda_hypothetical_dataset.csv")

In [3]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800,800,33119.0,2.0,Desktop,LOYAL,0,1
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800,2400,47764.0,2.0,Desktop,SUMMER,0,1
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200,3600,49900.0,3.0,Desktop,NEWUSER,0,0
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800,1600,30213.0,4.0,Desktop,NEWUSER,0,1
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800,1600,62067.0,4.0,Desktop,NONE,0,0

In [4]:
## data struc.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    object
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: float64(3), int64(4), object(9)
memory usage: 25.1+ KB

In [8]:
df['Last_Purchase_Date']=pd.to_datetime(df['Last_Purchase_Date'])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    datetime64[ns]
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: datetime64[ns](1), float64(3), int64(4), object(8)
memory usage: 25.1+ KB

In [19]:
## string to numeric conversion
df["price"]=(
    df["Price"]
    .astype(str)
    .str.replace("Rs","",regex=False)
    .str.strip()
)

df["Price"]=pd.to_numeric(df["Price"],errors="coerce")

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    datetime64[ns]
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               194 non-null    float64
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
 16  price               200 non-null    object
 17  Full_Location       200 non-null    object
 18  Cleaned_city        200 non-null    object
 19  country             200 non-null    object
dtypes: datetime64[ns](1), float64(4), int64(4), object(11)
memory usage: 31.4+ KB

In [21]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned,price,Full_Location,Cleaned_city,country
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800.0,800,33119.0,2.0,Desktop,LOYAL,0,1,800.0,Bangalore_India,Bangalore,India
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800.0,2400,47764.0,2.0,Desktop,SUMMER,0,1,800.0,Kolkata_India,Kolkata,India
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200.0,3600,49900.0,3.0,Desktop,NEWUSER,0,0,1200.0,Delhi_India,Delhi,India
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800.0,1600,30213.0,4.0,Desktop,NEWUSER,0,1,800.0,Kolkata_India,Kolkata,India
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800.0,1600,62067.0,4.0,Desktop,NONE,0,0,800.0,Mumbai_India,Mumbai,India

In [22]:
df["Full_Location"]= df["City"]+"_India"

In [23]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned,price,Full_Location,Cleaned_city,country
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800.0,800,33119.0,2.0,Desktop,LOYAL,0,1,800.0,Bangalore_India,Bangalore,India
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800.0,2400,47764.0,2.0,Desktop,SUMMER,0,1,800.0,Kolkata_India,Kolkata,India
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200.0,3600,49900.0,3.0,Desktop,NEWUSER,0,0,1200.0,Delhi_India,Delhi,India
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800.0,1600,30213.0,4.0,Desktop,NEWUSER,0,1,800.0,Kolkata_India,Kolkata,India
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800.0,1600,62067.0,4.0,Desktop,NONE,0,0,800.0,Mumbai_India,Mumbai,India

In [24]:
## split columns
df[["Cleaned_city","country"]]=df["Full_Location"].str.split("_",expand=True)

In [25]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned,price,Full_Location,Cleaned_city,country
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800.0,800,33119.0,2.0,Desktop,LOYAL,0,1,800.0,Bangalore_India,Bangalore,India
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800.0,2400,47764.0,2.0,Desktop,SUMMER,0,1,800.0,Kolkata_India,Kolkata,India
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200.0,3600,49900.0,3.0,Desktop,NEWUSER,0,0,1200.0,Delhi_India,Delhi,India
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800.0,1600,30213.0,4.0,Desktop,NEWUSER,0,1,800.0,Kolkata_India,Kolkata,India
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800.0,1600,62067.0,4.0,Desktop,NONE,0,0,800.0,Mumbai_India,Mumbai,India

In [27]:
##combine columns
df["customer_profile"]=df["Gender"].astype(str)+"_"+df["City"]

In [28]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,...,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned,price,Full_Location,Cleaned_city,country,customer_profile
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800.0,800,...,2.0,Desktop,LOYAL,0,1,800.0,Bangalore_India,Bangalore,India,Female_Bangalore
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800.0,2400,...,2.0,Desktop,SUMMER,0,1,800.0,Kolkata_India,Kolkata,India,Female_Kolkata
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200.0,3600,...,3.0,Desktop,NEWUSER,0,0,1200.0,Delhi_India,Delhi,India,Male_Delhi
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800.0,1600,...,4.0,Desktop,NEWUSER,0,1,800.0,Kolkata_India,Kolkata,India,Male_Kolkata
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800.0,1600,...,4.0,Desktop,NONE,0,0,800.0,Mumbai_India,Mumbai,India,Female_Mumbai

In [29]:
pivot_df=df.pivot_table(
    values="Total_Amount",
    index="City",
    columns="Product",
    aggfunc="mean"
)

In [30]:
pivot_df.head()

Product          A            B            C            D
City
Bangalore   1200.0  2228.571429  1662.846154  1875.000000
Bangalore      NaN          NaN  1600.000000          NaN
Chennai     1050.0  3200.000000  2114.285714  2142.857143
DELHI          NaN          NaN          NaN  6000.000000
Delhi       1200.0  3116.333333  2189.888889  3950.181818

In [34]:
df['Signup_Date']=pd.to_datetime(df['Signup_Date'])
df["Signup_Month"]=df["Signup_Date"].dt.to_period('M')

ValueError: time data "19-Jun-2022" doesn't match format "%Y-%m-%d", at position 82. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 21 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    datetime64[ns]
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               194 non-null    float64
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
 16  price               200 non-null    object
 17  Full_Location       200 non-null    object
 18  Cleaned_city        200 non-null    object
 19  country             200 non-null    object
 20  customer_profile    200 non-null    object
dtypes: datetime64[ns](1), float64(4), int64(4), object(12)
memory usage: 32.9+ KB

In [36]:
pd.to_datetime(df["Signup_Date"],errors="coerce")

0     2022-10-04
1     2024-01-31
2     2023-11-07
3     2023-01-29
4     2023-04-02
         ...
195   2023-07-12
196          NaT
197   2022-09-10
198   2023-01-25
199   2023-08-17
Name: Signup_Date, Length: 200, dtype: datetime64[ns]

In [37]:
df["Signup_Date"] =pd.to_datetime(df["Signup_Date"],
errors="coerce")

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 21 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         195 non-null    datetime64[ns]
 5   Last_Purchase_Date  195 non-null    datetime64[ns]
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               194 non-null    float64
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
 16  price               200 non-null    object
 17  Full_Location       200 non-null    object
 18  Cleaned_city        200 non-null    object
 19  country             200 non-null    object
 20  customer_profile    200 non-null    object
dtypes: datetime64[ns](2), float64(4), int64(4), object(11)
memory usage: 32.9+ KB

In [39]:
df["Signup_Month"]=df["Signup_Date"].dt.to_period('M')

In [40]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,...,Device,Promo_Code,Fraud_Flag,Churned,price,Full_Location,Cleaned_city,country,customer_profile,Signup_Month
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800.0,800,...,Desktop,LOYAL,0,1,800.0,Bangalore_India,Bangalore,India,Female_Bangalore,2022-10
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800.0,2400,...,Desktop,SUMMER,0,1,800.0,Kolkata_India,Kolkata,India,Female_Kolkata,2024-01
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200.0,3600,...,Desktop,NEWUSER,0,0,1200.0,Delhi_India,Delhi,India,Male_Delhi,2023-11
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800.0,1600,...,Desktop,NEWUSER,0,1,800.0,Kolkata_India,Kolkata,India,Male_Kolkata,2023-01
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800.0,1600,...,Desktop,NONE,0,0,800.0,Mumbai_India,Mumbai,India,Female_Mumbai,2023-04

In [42]:
df["Signup_Month"].head()

0    2022-10
1    2024-01
2    2023-11
3    2023-01
4    2023-04
Name: Signup_Month, dtype: period[M]

In [43]:
monthly_signup=df.pivot_table(
    index="Signup_Month",
    values="Customer_ID",
    aggfunc="count"
)

In [44]:
monthly_signup.head()

              Customer_ID
Signup_Month
2022-01                 7
2022-02                 8
2022-03                 7
2022-04                 6
2022-05                11